In [1]:
import pandas as pd

In [3]:
print(pd.__version__)

2.2.3

In [4]:
#A Series is like a single column of data — it has both values and index (labels).

s = pd.Series([10,20,30,40,50] , name = "Scores")
print(s)

0    10
1    20
2    30
3    40
4    50
Name: Scores, dtype: int64

In [5]:
#Task Create a Series for:Names of 5 students Their ages Their marks and print them.

s_name = pd.Series(["Nikhil", "Rahul", "Peter" , "Sardar" , "tyrion"],name="students_name")
s_age = pd.Series([21,21,32,40,34], name="students_age")
s_marks = pd.Series([70,32,50,-10,100])

print(s_name)
print(s_age)
print(s_marks)

0    Nikhil
1     Rahul
2     Peter
3    Sardar
4    tyrion
Name: students_name, dtype: object
0    21
1    21
2    32
3    40
4    34
Name: students_age, dtype: int64
0     70
1     32
2     50
3    -10
4    100
dtype: int64

In [7]:
#Task Create a DataFrame for 5 books — with columns: Title, Author, Price, Year Display it Try df.shape and df.info() — see what they show.

books_data = {
  'Title' : ["hoah",'apap','weiooi','lalrahla','hfla'],
  'Author' : ["Nikhil", "Rahul", "Peter" , "Sardar" , "tyrion"],
  'Price' : [700,320,500,610,1008], 
  'Year' : [2022,1802,1990,2003,1829]
}

df = pd.DataFrame(books_data)
print(df)
print("shape : ", df.shape)
print("info : " ,df.info)

      Title  Author  Price  Year
0      hoah  Nikhil    700  2022
1      apap   Rahul    320  1802
2    weiooi   Peter    500  1990
3  lalrahla  Sardar    610  2003
4      hfla  tyrion   1008  1829
shape :  (5, 4)
info :  <bound method DataFrame.info of       Title  Author  Price  Year
0      hoah  Nikhil    700  2022
1      apap   Rahul    320  1802
2    weiooi   Peter    500  1990
3  lalrahla  Sardar    610  2003
4      hfla  tyrion   1008  1829>

In [8]:
print(df.head(2))

  Title  Author  Price  Year
0  hoah  Nikhil    700  2022
1  apap   Rahul    320  1802

In [9]:
print(df.tail(2))

      Title  Author  Price  Year
3  lalrahla  Sardar    610  2003
4      hfla  tyrion   1008  1829

In [10]:
print(df.columns)

Index(['Title', 'Author', 'Price', 'Year'], dtype='object')

In [12]:
print(df.describe())

             Price         Year
count     5.000000     5.000000
mean    627.600000  1929.200000
std     255.516731   104.850846
min     320.000000  1802.000000
25%     500.000000  1829.000000
50%     610.000000  1990.000000
75%     700.000000  2003.000000
max    1008.000000  2022.000000

In [13]:
print(df['Title'])

0        hoah
1        apap
2      weiooi
3    lalrahla
4        hfla
Name: Title, dtype: object

In [18]:
print(df['Price'] > 400)

0     True
1    False
2     True
3     True
4     True
Name: Price, dtype: bool

In [23]:
print(df[(df['Price'] > 400) & (df['Year'] > 2000)])

      Title  Author  Price  Year
0      hoah  Nikhil    700  2022
3  lalrahla  Sardar    610  2003

In [25]:
print(df.sort_values(by='Price' ,ascending=False))

      Title  Author  Price  Year
4      hfla  tyrion   1008  1829
0      hoah  Nikhil    700  2022
3  lalrahla  Sardar    610  2003
2    weiooi   Peter    500  1990
1      apap   Rahul    320  1802

In [26]:
print(df.sort_values(by=['Year', 'Price'], ascending=[True, False]))

      Title  Author  Price  Year
1      apap   Rahul    320  1802
4      hfla  tyrion   1008  1829
2    weiooi   Peter    500  1990
3  lalrahla  Sardar    610  2003
0      hoah  Nikhil    700  2022

In [29]:
import numpy as np 
data = {
    'Name': ['Nikhil', 'Rahul', 'Peter', 'Rahul', np.nan],
    'Age': [21, np.nan, 32, 21, 25],
    'Marks': [70, 32, np.nan, 32, 100],
    'City': ['Bhopal', 'Delhi', 'Mumbai', 'Delhi', None]
}

In [30]:
df = pd.DataFrame(data)

In [31]:
print(df)

     Name   Age  Marks    City
0  Nikhil  21.0   70.0  Bhopal
1   Rahul   NaN   32.0   Delhi
2   Peter  32.0    NaN  Mumbai
3   Rahul  21.0   32.0   Delhi
4     NaN  25.0  100.0    None

In [32]:
print(df.isnull())

    Name    Age  Marks   City
0  False  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False  False  False  False
4   True  False  False   True

In [33]:
print(df.isnull().sum())

Name     1
Age      1
Marks    1
City     1
dtype: int64

In [34]:
# to remove incomplete rows df.dropna()

In [38]:
df['Age'].fillna(0, inplace=True)

In [42]:
df['Marks'] = df['Marks'].fillna(df['Marks'].mean())
df['Age'] = df['Age'].fillna(df['Age'].median())

In [43]:
print(df.duplicated())

0    False
1    False
2    False
3    False
4    False
dtype: bool